{
  "hardSkills": [
    {
      "src": "/assets/imgs/skill-react.webp",
      "srcTab": "/assets/imgs/skill-react-tab.webp",
      "alt": "React skill",
      "name": "React",
      "details": "From crafting components to managing states, I bring web dreams to life with ease, whether it's routing with React Router, fetching data with React Query, integrating PrimeReact for rich UI components, or diving into Redux."
    },
    {
      "src": "/assets/imgs/skill-typescript.webp",
      "srcTab": "/assets/imgs/skill-typescript-tab.webp",
      "alt": "Typescript skill",
      "name": "Typescript",
      "details": "TypeScript - Discovered at work, now my coding companion. TypeScript's simplicity and reliability won me over in no time."
    },
    {
      "src": "/assets/imgs/skill-styling.webp",
      "srcTab": "/assets/imgs/skill-styling-tab.webp",
      "alt": "CSS skill",
      "name": "CSS Approaches",
      "details": "From organizing styles with CSS Modules to enhancing flexibility with SASS, seamlessly integrating styles and components with styled-components, and crafting efficient designs with Tailwind CSS – my CSS journey is a dynamic blend of techniques and creativity!"
    },
    {
      "src": "/assets/imgs/skill-cicd.webp",
      "srcTab": "/assets/imgs/skill-cicd-tab.webp",
      "alt": "CI/CD skill",
      "name": "CI/CD",
      "details": "Proficient in Git (GitHub/Bitbucket/GitLab), CI/CD and Agile, I streamline software development with automated processes, ensuring rapid delivery of high-quality code."
    },
    {
      "src": "/assets/imgs/skill-database.webp",
      "srcTab": "/assets/imgs/skill-database-tab.webp",
      "alt": "Database skill",
      "name": "Database",
      "details": "To power my applications, Supabase and MS-SQL are my go-to solutions. With Supabase's flexibility and MS-SQL's reliability, I ensure seamless support for all my projects."
    },
    {
      "src": "/assets/imgs/skill-ui.webp",
      "srcTab": "/assets/imgs/skill-ui-tab.webp",
      "alt": "UI/UX Design skill",
      "name": "UI/UX Design",
      "details": "Exploring the art of crafting user-centric designs, aiming to create intuitive interfaces that enhance the user experience."
    }
  ],

  "softSkills": [
    {
      "src": "/assets/imgs/skill-flexible.webp",
      "srcTab": "/assets/imgs/skill-flexible-tab.webp",
      "alt": "Flexible & Adaptable skill",
      "name": "Flexible & Adaptable",
      "details": "I easily pivot to meet new challenges and embrace change with enthusiasm. Whether it's adjusting to new technologies or shifting project priorities, I thrive in dynamic environments, bringing versatility and resilience to every task."
    },
    {
      "src": "/assets/imgs/skill-learner.webp",
      "srcTab": "/assets/imgs/skill-learner-tab.webp",
      "alt": "Fast Learner skill",
      "name": "Fast Learner",
      "details": "A fast learner, I quickly absorb new concepts and technologies, adapting them to solve problems and drive projects forward. With a curious mindset and a hunger for knowledge, I'm always eager to explore new ideas and expand my skills."
    },
    {
      "src": "/assets/imgs/skill-details.webp",
      "srcTab": "/assets/imgs/skill-details-tab.webp",
      "alt": "Attentive To Details skill",
      "name": "Attentive To Details",
      "details": "I meticulously ensure that every aspect of a project is meticulously crafted. From pixel-perfect designs to error-free code, I prioritize precision in every task, enhancing the overall quality and user experience."
    },
    {
      "src": "/assets/imgs/skill-analytical.webp",
      "srcTab": "/assets/imgs/skill-analytical-tab.webp",
      "alt": "Analytical Thinking skill",
      "name": "Analytical Thinking",
      "details": "Analytical by nature, I dissect problems to uncover insights and devise strategic solutions that drive projects forward."
    },
    {
      "src": "/assets/imgs/skill-organized.webp",
      "srcTab": "/assets/imgs/skill-organized-tab.webp",
      "alt": "Highly Organized skill",
      "name": "Highly Organized",
      "details": "Highly organized and a lover of to-do lists, I thrive on structure and efficiency. With meticulous planning and prioritization, I ensure tasks are completed with precision and deadlines are met with ease."
    },
    {
      "src": "/assets/imgs/skill-team.webp",
      "srcTab": "/assets/imgs/skill-team-tab.webp",
      "alt": "Team Oriented skill",
      "name": "Team Oriented",
      "details": "By fostering open communication and mutual respect, I contribute to a positive team dynamic, working collectively towards shared goals and driving success together."
    }
  ],
  "projects": [
    {
      "src": "/assets/imgs/project-quiz.webp",
      "alt": "Project Quiz",
      "codeLink": "https://github.com/SabinaCristea/frontend-quiz",
      "siteLink": "https://frontend-quiz-sabina.netlify.app/",
      "description": "A responsive quiz app crafted using React, TypeScript, Vite, and Context API. Choose from 4 quiz types for an engaging learning experience, enhanced with a sleek dark mode for comfortable viewing in any environment."
    },
    {
      "src": "/assets/imgs/project-wild-oasis.webp",
      "alt": "Project Wild Oasis",
      "codeLink": "https://github.com/SabinaCristea/the-wild-oasis",
      "siteLink": "https://the-wild-oasis-sabina.netlify.app/login",
      "description": "An all-inclusive hotel management application designed for employees, featuring robust authentication, reservation management (booking, updating, and deleting reservation), dark mode for comfortable usage, and intuitive sorting and filtering of information. Developed as part of the Ultimate React course by Jonas Schmedtmann, utilizing React Router, Styled Components, Vite, Context API, React Query, Recharts, Supabase, and other tools."
    },
    {
      "src": "/assets/imgs/project-worldwise.webp",
      "alt": "Project WorldWise",
      "codeLink": "https://github.com/SabinaCristea/worldwise",
      "siteLink": "https://worldwise-sabina.netlify.app/",
      "description": "WorldWise is your go-to travel companion, allowing you to effortlessly track the cities you've visited worldwide, complete with dates and personalized trip notes. Seamlessly login to access your travel history and enrich your journey experiences. Powered by React Datepicker, Leaflet for map integration, and leveraging Vite and Router for smooth navigation and efficient performance. Unlock the world with WorldWise."
    },
    {
      "src": "/assets/imgs/project-age-calculator.webp",
      "alt": "Project Age Calculator",
      "codeLink": "https://github.com/SabinaCristea/age-calculator-app",
      "siteLink": "https://age-calculator-app-sabina.netlify.app/",
      "description": "An intuitive age calculator app built with Flexbox, CSS Grid, and Vanilla JavaScript. Simply input your birthdate, and instantly calculate your age. Enjoy a responsive design that adapts seamlessly to various screen sizes. Experience real-time validation to catch errors and ensure accurate inputs, enhancing user experience and reliability."
    },
    {
      "src": "/assets/imgs/project-pizza.webp",
      "alt": "Project Pizza",
      "codeLink": "https://github.com/SabinaCristea/fast-react-pizza",
      "siteLink": "https://react-pizza-sabina.netlify.app/",
      "description": "A dynamic pizza ordering application developed with React, Redux, Vite, and Tailwind CSS. Browse through a diverse selection of pizzas, add items to your basket, and effortlessly modify quantities. Utilizing APIs for geocoding and pizza listings, the app enhances user convenience. Receive a unique order number and access order history by searching with the order number. Seamlessly place orders through a comprehensive form, with the option to prioritize orders, adjusting pricing and delivery time accordingly."
    },
    {
      "src": "/assets/imgs/project-pomodoro.png",
      "alt": "Project Pomodoro",
      "codeLink": "https://github.com/SabinaCristea/pomodoro-app",
      "siteLink": "https://pomodoro-app-sabina.netlify.app/",
      "description": "The Pomodoro App is a timer application that allows users to set Pomodoro, short break, and long break timers, with customization options for each timer's duration. It features a circular progress bar that updates every minute to show the timer's progress and offers customizable appearance settings for colors and fonts. Built with Vite, React and Tailwind CSS, this project ensures a responsive and user-friendly experience across all devices, adhering closely to the provided design specifications."
    },
    {
      "src": "/assets/imgs/project-clock.png",
      "alt": "Project Clock App",
      "codeLink": "https://github.com/SabinaCristea/clock-app",
      "siteLink": "https://clock-app-sabina.netlify.app/",
      "description": "The Clock Application is a dynamic web app that displays the current time and location based on the visitor's IP address. It offers additional date and time details, a greeting and background image based on the time of day, and generates random programming quotes. Featuring a responsive design and interactive hover states, it ensures an optimal user experience across devices. Built with Vite, React, Tailwind CSS, and external APIs for location and quotes, this project delivers a comprehensive and engaging user interface."
    }
  ]
}
